<template>
  <view-box class="viewbox" body-padding-top="46px" body-padding-bottom="0">
    <x-header class="positionHeader" :left-options="{showBack: true}" title="注册协议"></x-header>
    <div class="agreement">
      在注册成为董基金网站用户（以下称“您”或者“用户”）前，请您仔细阅读并充分理解本《注册协议》（以下简称“本协议”）全部内容。

      <p class="title"><b>第一条 定义及释义</b></p>
      <p>1.1董基金是通过智子量化平台以量化的方式投资的基金管理有限公司。</p>

      <p>1.2本网站在《注册协议》及《投资服务协议》中的所有行为，仅且只是：</p>

      <p>1.2.1投资居间或媒介的金融服务。</p>

      <p>1.2.2基于1.2.1条前提下的，符合本公司注册营业范围、法律及规定的投资咨询与管理金融服务。</p>

      <p>1.2.3基于1.2.1条前提下的，符合本公司注册营业范围、法律及规定、本网站相关协议的金融服务。</p>

      <p>1.3用户通过本网站居间服务进行投资的所有资金均在用户以自己名义开立的银行账户下，本网站并不存放任何投资资金。</p>

      <p>1.4“本网站协议”是指包括本协议在内的本网站所有协议及规则。</p>

      <p class="title"><b>第二条 协议生效</b></p>

      <p>2.1您只要勾选本网站注册栏下方的“我同意《注册协议》”选项并成功注册为本网站用户，视为您已经充分理解和同意本协议全部内容，并签署了本协议，本协议立即在您与本网站之间产生合同法律效力。</p>
      <p>2.2本协议生效后，您注册使用本网站服务的全部活动将受到本协议的约束，并将以自己名义履行相应的合同义务。</p>

      <p>2.3本协议生效后，您应当严格依照本协议1.2条规定进行行为，不得作出违反本网站1.2条的话语陈述及行为。</p>

      <p>2.4本协议生效后，如有违反本协议或者国家法律而导致任何法律后果的产生，您将以自己的名义独立承担相应法律责任。</p>

      <p class="title"><b>第三条 协议依据</b></p>

      <p>3.1本协议的协定依据：</p>

      <p>3.1.1《中华人民共和国民法通则》</p>

      <p>3.1.2《中华人民共和国合同法》</p>

      <p>3.1.3《全国人民代表大会常务委员会关于加强网络信息保护的决定》</p>

      <p>3.1.4《最高人民法院、最高人民检察院关于办理利用互联网、移动通讯终端、声讯台制作、复制、出版、贩卖、传播淫秽电子信息刑事案件具体应用法律若干问题的解释》</p>
      <p>3.1.5其他与本协议相关的法律、法规、规章、政策、规定等。</p>
      <p class="title"><b>第四条 身份限制</b></p>

      <p>4.1 注册本网站的中华人民共和国自然人用户必须满足以下主体资格条件：</p>

      <p>4.1.1具有中华人民币共和国（以下简称“中国”）国籍（不包括中国香港、澳门及台湾地区）；</p>

      <p>4.1.2年龄在18周岁以上；</p>

      <p>4.1.3具有完全民事权利能力及行为能力。</p>

      <p>
        4.2如不具备4.1条所述条件，您只能在父母或其他监护人的监护参与下才能使用本网站。否则，您应立即停止在本网站的注册程序、停止使用本网站服务，本网站有权随时终止您的注册进程及本网站服务，您应对您的注册给本网站带来的全部损失承担赔偿责任，且您的监护人应承担连带责任。</p>

      <p>4.3注册本网站的其他自然人必须满足中国及相关国家法律进行本协议项下行为而规定的全部主体资格条件。</p>

      <p>4.4注册本网站的中国法人用户必须满足以下主体资格条件：</p>

      <p>4.4.1在中华人民共和国合法注册并有效成立；</p>

      <p>4.4.2法人及公司董事、股东、高管不存在任何违法及犯罪行为；</p>

      4.4.3资金来源合法。

      4.5注册本网站的中国法律组织必须满足以下主体资格条件：

      4.5.1合法成立；

      4.5.2组织及组织代表、成员不存在任何违法及犯罪行为；

      4.5.3资金来源合法。

      4.6注册本网站的其他法人及组织必须满足中国及相关国家法律进行本协议项下行为而规定的全部主体资格条件。

      4.7注册成为本网站用户必须满足本协议4.1、4.2、4.3、4.4、4.5条所述法律主体资格条件，若不具备前述主体资格条件，请立即终止注册使用本网站服务。

      4.8若违反4.7条规定注册使用本网站服务，本网站保留终止用户资格、追究用户或用户的监护人相关法律责任的权利。

      <p class="title"><b>第五条 协议文本</b></p>

      <p>5.1 本协议的内容包括本协议全部内容以及本网站已经发布的及将来可能发布的和各类规则。</p>

      <p>5.2本网站所有规则均为本协议不可分割的一部分，与本协议具有同等法律效力。</p>

      <p>5.3本网站后发布的规则与之前规则的个别或部分不一致时，以后发布的规则为准。</p>

      <p>5.4用户在此确认并知悉，同意本网站有权根据需要不时修改、增加或删除本协议。</p>

      <p>5.5如本协议任何内容或本网站各项规则有任何变更，本网站将在网站上即时发布公告，用户有义务注意该等公示。</p>

      <p>5.6本协议文本经修订的相关条款和规则以发布公告方式作出，一经在本网站发布即视为送达，且于公告规定的特定生效日期自动生效。</p>

      <p>5.7用户如不同意本协议5.5条所述变更，应立即停止使用本网站服务，本公司保留中止、终止或限制用户继续使用本网站服务的权利，但该等终止、中止或限制行为并不豁免用户在本网站已经进行的交易下所应承担的责任和义务。</p>

      <p>5.8发生5.7条所述情形时，本网站不承担任何因此导致的法律责任。</p>

      <p class="title"><b>第六条 使用限制</b></p>

      <p>6.1
        在注册时和使用本网站服务的所有期间，您应根据本网站的要求提供您自身的真实资料及信息（包括但不限于电子邮件地址、联系电话、联系地址、邮政编码、个人身份信息、征信信息等），并保证自您注册之时起至您使用本网站服务的所有期间，您所提交的所有资料及信息：</p>

      <p>6.1.1具备最新性、真实性、准确性、完整性、有效性、合法性。</p>

      <p>6.1.2各种形式复印件与原件一致。</p>

      <p>6.2如您向本网站提供的各项资料及信息发生变更，您应当即时向本网站更新相应的资料和信息，如因您未即时更新资料和信息导致本网站无法向您提供服务或发生错误，由此导致的全部法律责任和后果将由您独立承担。</p>

      <p>
        6.3如您使用他人资料、信息和文件注册使用本网站服务或向本网站提供的资料和信息不符合本协议6.1条规定，由此引起的一切后果和法律责任均由您本人全部承担，本网站不因此承担任何法律责任，如因此而给本网站及其他用户造成任何损失，您应当承担赔偿本网站及其他用户损失的法律责任。</p>

      <p>
        6.4您在注册时向本网站提交的电子邮箱、用户名、密码及安全问题答案是您在本网站的唯一识别信息。您注册成功后，您应当妥善保管自己的用户名和密码，不得将注册的电子邮箱、用户名、密码及安全问题答案转让或授权给第三方使用。</p>

      <p>6.5用户在此确认：</p>

      <p>
        6.5.1使用您的用户名和密码登陆本网站后在本网站的一切行为用户在本网站的用户账户下发出的一切指令均视为用户本人的行为和意思，该等指令不可逆转，由此产生的一切责任和后果由用户本人承担，本公司及本网站不承担任何责任。</p>

      <p>6.5.2在本网站注册时提交的包括电子邮箱在内的个人资料和信息，在本网站使用该资料及信息均视为用户本人的行为和意思，由此产生的一切后果和法律责任由用户本人承担，本公司及本网站不承担任何法律责任。</p>

      <p>6.6用户不得利用本网站或本网站服务（包括但不限于站内信息服务、群组服务、论坛服务或其他电子邮件转发服务）从事下列任何行为：</p>

      <p>6.6.1不符合中国法律、法规、规章。</p>

      <p>6.6.2不符合政府及部门的政策、规定、会议精神。</p>

      <p>6.6.3违反本协议及本网站相关协议。</p>

      <p>6.6.4侵犯本网站及他人权益。</p>

      <p>6.7用户违反本协议6.6条时：</p>

      <p>6.7.1有权采取包括删除言论、不经您同意而阻止该等行为、不经通知您而立即停止您对本网站的全部或部分功能的使用等行为在内的行为。</p>

      <p>6.7.2所产生的一切后果和法律责任与本网站无关，由用户自行承担，如因此给本网站造成损失的，由用户赔偿本网站的一切损失。</p>

      <p>6.7.3本网站保留将您的违法违规行为及有关信息资料计入用户信用档案、依法提供给有关政府部门或按照本网站相关协议约定提供给第三方的权利。</p>

      <p class="title"><b>第七条 服务内容</b></p>

      <p>7.1 本网站通过本网站以及其他渠道和方式向您提供以下服务中的一项或多项：</p>

      <p>7.1.1投资居间或媒介的金融服务。</p>

      <p>7.1.2基于7.1.1条前提下的，符合本公司注册营业范围、法律及规定的投资咨询与管理金融服务。</p>

      <p>7.1.3基于7.1.1条前提下的，符合本公司注册营业范围、法律及规定、本网站相关协议的其他金融服务。</p>

      <p class="title"><b>第八条 服务费用</b></p>

      <p>8.1本网站不向用户及投资者收取任何费用 。</p>

      <p class="title"><b>第九条 用户信息的披露及保护</b></p>

      <p>9.1用户在此确认并同意，您同意本网站在业务运营过程中收集和储存您的相关信息，包括但不限于您自行提供的资料和信息，以及本网站自行收集、取得的您在本网站的交易记录和使用信息等。</p>

      <p>9.2本网站依照本协议9.1条收集和储存的用户信息，有权按照本网站相关协议的约定进行使用或者披露。</p>

      <p>9.3 您同意本网站在业务运营中使用您的用户信息，包括但不限于：</p>

      <p>9.3.1基于履行本网站相关关协议、解决争议、调停纠纷、保障本网站用户交易安全的目的等使用用户的个人资料。</p>

      <p>9.3.2对用户信息进行抽查、核实以识别问题或解决争议，特别是本网站可审查您的资料以区分使用多个用户名或别名的用户。</p>

      <p>9.3.3向本网站的合作方及投资项目合作方（该合作机构仅限于本网站为了完成拟向您提供的服务而合作的机构）提供您的用户信息。</p>

      <p>9.3.4通过人工或自动程序对您的信息进行评估、分类、研究、衡量。</p>

      <p>
        9.3.5同意本公司可以使用您个人资料以改进本网站的推广和促销工作、分析网站的使用率、改善本网站的内容和产品推广形式，并使本网站内容、设计和服务更能符合用户的要求。这些使用能改善本网站的网页，以调整本网站网页使其更能符合用户的需求，从而使用户在使用本网站服务时得到更为顺利、有效、安全及度身订造的交易体验。</p>

      <p>9.3.6用户在此同意允许本公司通过在本网站的某些网页上使用诸如“Cookies”的设置收集用户信息并进行分析研究，以为用户提供更好的量身服务。</p>

      <p>9.3.7使用您提供的联系方式与您联络并向您传递有关业务和管理方面的信息。</p>

      <p>9.3.8本公司有义务根据有关法律、法规、规章及其他政府规范性文件的要求向司法机关和政府部门提供本协议9.1条所述的用户个人资料及信息。</p>

      <p>
        9.3.9本网站将采用行业标准惯例以保护您的用户信息，包括建立相应的信息保护制度和机制、采用行业通常技术和设备等，但上述保护措施可能受限于技术水平限制而不能确保您的信息不会通过本协议中未列明的途径泄露出去，本网站不承担因此而导致的任何损失或责任。</p>

      <p class="title"><b>第十条 免责条款</b></p>

      <p>10.1本网站仅依据本网站协议作为居间方负担义务与责任，并不对其他合同中其他合同方的义务与责任进行明示或默示的保证。</p>

      <p>10.2非本网站原因致使您账户密码或相关信息泄露的，您应及时通知本网站，以减少可能发生的损失，因上述原因导致的损失需由您自行承担。</p>

      <p>10.3
        用户发现有他人冒用或盗用您的账户及密码，或利用您的信息进行与本网站相关的任何其他不合法行为时，应立即以书面方式通知本网站并要求本网站暂停服务。本网站将积极响应您的要求。但对您的要求采取行动需要合理期限，在此之前，本网站对已执行的指令及(或)所导致的您的损失不承担任何责任。</p>

      <p>10.4
        本网站内容不排除涉及或链接到由第三方所有、控制或者运营的其他网站（“第三方网站”）。对此，本网站不能保证也没有义务保证第三方网站上的信息的真实性、有效性、合法性等。您确认按照第三方网站的注册协议而非本注册协议使用第三方网站，第三方网站的内容、产品、广告和其他任何信息均由您自行判断并承担风险。</p>

      <p>
        10.5基于互联网的特殊性，本网站无法保证本网站的服务不会中断，对于包括但不限于情形而造成服务中断，致使本网站未能履行本协议或履行本协议不符合约定，不构成本网站的违约，因此给用户造成的损失，本网站不承担任何责任，有关损失由用户自己承担。</p>

      <p>10.5.1本网站及相关第三方的设备、系统存在缺陷等类似原因。</p>

      <p>10.5.2计算机发生故障、遭到病毒、黑客攻击等类似技术事件。</p>

      <p>10.5.3停止供应主要服务、电力中断、交通中断等类似意外事件。</p>

      <p>10.5.4经济形势严重恶化、政府管制等类似重大社会事件。</p>

      <p>10.5.5发生地震、海啸、雷电、火灾、瘟疫、流行病、战争、恐怖主义、敌对行为、暴动、罢工等不可抗力。</p>

      <p>
        10.6本公司无监测第三方通过各种形式发布在本网站上的不属于本网站或本网站信息被篡改后内容的义务，用户对于本网站披露的信息、选择使用本网站提供的服务，选择参与交易等，应当自行判断其真实性和承担风险，由此而产生的法律责任和后果由用户自己承担，本网站不承担任何责任。</p>

      <p class="title"><b>第十一条 送达</b></p>

      <p>11.1除本协议5.6条规定外，其他向您个人发布的具有专属性的通知将通过以下方式发送：</p>

      <p>11.1.1电子邮件：发件箱为本网站官方邮箱sbohui@126.com，收件箱为您在注册时或者注册后变更用户信息时向本网站提供的电子邮箱。</p>

      <p>11.1.2通知中心：本网站在本网站上您个人账户中为您设置的“通知中心”。</p>

      <p>11.1.3移动手机：您在注册后在本网站提供的手机号。</p>

      <p>11.2您有义务密切关注本协议11.1条所述您的电子邮箱中的邮件 、“通知中心”中的邮件和信息、手机中的短信信息。</p>

      <p>11.3本网站向您个人发布的具有专属性的通知通过本协议11.1条方式一经发送即视为已经送达。</p>

      <p class="title"><b>第十二条 违约责任</b></p>

      <p>12.1如一方发生违约行为，守约方可以书面通知方式要求违约方在指定的时限内停止违约行为，并就违约行为造成的损失要求违约方进行赔偿。</p>

      <p>12.2本协议其他条款涉及违约后情形处理但并无违约赔偿责任规定的，并不排除本协议12.1条关于违约赔偿责任的适用。</p>

      <p>12.3本协议其他条款涉及违约赔偿责任规定的，其他条款关于违约赔偿责任的规定优先于本协议12.1条的规定而适用。</p>

      <p class="title"><b>第十三条 适用法律和管辖</b></p>

      <p>13.1本协议的订立、执行和解释适用中国大陆地区适用的法律，但不包括其冲突法规则。</p>

      <p>13.2如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。</p>

      <p>13.3与本协议的解释和履行有关的争议应由本公司住所地具有管辖权的人民法院管辖。</p>

      <p class="title"><b>第十四条 协议终止</b></p>

      <p>14.1 发生以下情形时，确认本协议终止。</p>

      <p>14.1.1本网站终止。</p>

      <p>14.1.2您申请终止本协议且经本网站同意。</p>

      <p>14.1.3您注销相应用户账户且经本网站同意。</p>

      <p>14.1.4您违反了本协议、本网站发布的相关规则或在相关法律法规、政府部门的要求下，本网站有权通过本协议第十一条约定的通知方式（包括但不限于电子邮件）告知您终止本协议、关闭您的账户或者限制您使用本网站。</p>

      <p>14.2当您不再符合本协议第四条约定的注册用户身份限制条件或其他法定原因致使本协议或 《投资服务协议》无法继续履行时，本协议依法终止。</p>

      <p>14.3依据本协议14.2条终止本协议后，您的合法授权代表、继承人、监护人、直系亲属在提交相关证明文件后，可向本网站申请查询您在本网站注册的用户信息及其他交易信息，并办理资产的转移。同时，本网站有权关闭您的账户。</p>

      <p class="title"><b>第十五条 其他</b></p>

      <p>11.1 若本协议的部分条款被认定为无效或者无法实施时，本协议中的其他条款仍然有效。</p>

      <p>11.2本协议处理终止事项的前提条款及后续条款独立于本协议，依据本协议或法定原因终止本协议后，继续有效。</p>

      <p>11.3本网站对本协议享有最终的解释权。</p>
    </div>
  </view-box>
</template>

<script>
  import {
    XHeader,
    XInput,
    Group,
    XButton,
    Cell, ViewBox
  } from 'vux'

  export default {
    name: "agreement",
    components: {
      XHeader,
      XInput,
      Group,
      XButton,
      Cell, ViewBox
    },
    activated() {
      this.setLoading(false);
    },
  }
</script>

<style scoped>

</style>
